Show / Hide Table of Contents
Class Polygon2D
Represents a polygon in two-dimensional space.
Inheritance
System.Object
OpenObject
Polygon2D
TemperatureCurve2D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry2D.Polygon2D,CI.Geometry2D")]
public class Polygon2D : OpenObject
Constructors
Improve this Doc   View Source
Polygon2D()
Constructor
Declaration
public Polygon2D()
Properties
Improve this Doc   View Source
Points
List of polygon points
Declaration
public List<Point2D> Points { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Point2D>
 Improve this Doc
 View Source